export const data = {
  mercury: {
    semiMajorAxesKm: 57909050,
    cameraPosition: { x: 0.02, y: 0, z: 0.29 },
    cameraLookAtPosition: { x: 0.03, y: 0, z: 0.02 },
    lerpSpeed: 0.08,
    planetNameUkr: "Меркурій",
    description:
      "Породи Меркурія — це поєднання рідкісних металевих кристалів і звичайних базальтових уламків. Темні, шорсткі камені з сірими та чорними відтінками ідеально передають атмосферу першої планети від Сонця. Частина уламків виглядає як застиглий слід від ударів астероїдів, що надає їм унікальної естетики.",
  },
  venus: {
    semiMajorAxesKm: 108208000,
    cameraPosition: { x: -0.1, y: 0, z: 0.29 },
    cameraLookAtPosition: { x: 0.019, y: 0, z: 0.02 },
    lerpSpeed: 0.07,
    planetNameUkr: "Венера",
    description:
      "На Венері можна знайти як вражаючі вулканічні скелі насиченого чорного кольору, так і гладкі уламки застиглої лави. Камені мають характерні золотисті прожилки, створені хімічними реакціями. Вони несуть у собі енергію однієї з найспекотніших планет у Сонячній системі.",
  },
  earth: {
    semiMajorAxesKm: 149598023,
    cameraPosition: { x: 0.01, y: 0, z: 0.39 },
    cameraLookAtPosition: { x: 0.033, y: 0, z: 0.02 },
    lerpSpeed: 0.05,
    planetNameUkr: "Земля",
    description:
      "Земля пропонує широкий спектр каменів — від дорогоцінних кристалів до уламків гірських порід, сформованих мільйони років тому. Від яскравого сяйва до грубих, природних текстур — ці породи підходять як для ювелірних виробів, так і для створення декоративних елементів. На її супутнику, Місяці, можна знайти застиглі уламки лави з темними сірими відтінками, а також пористі камені, вкриті місячним пилом, що ідеально передають холодну таємничість супутника Землі.",
  },
  mars: {
    semiMajorAxesKm: 227939200,
    cameraPosition: { x: 0.0001, y: 0, z: 0.29 },
    cameraLookAtPosition: { x: 0.025, y: 0, z: 0.02 },
    lerpSpeed: 0.06,
    planetNameUkr: "Марс",
    description:
      "Червона планета приваблює своїми залізовмісними породами, які мають багаті помаранчеві та червоні відтінки. Окрім цього, можна знайти гірські уламки, вкриті пилом марсіанського реголіту, що додає їм автентичності. Ці камені чудово підійдуть для тих, хто хоче відчути атмосферу чужого світу.",
  },
  jupiter: {
    semiMajorAxesKm: 778340821,
    cameraPosition: { x: 0.001, y: 0, z: 1.3 },
    cameraLookAtPosition: { x: 0.11, y: 0, z: 0.02 },
    lerpSpeed: 0.04,
    planetNameUkr: "Юпітер",
    description:
      "Хоча Юпітер не має твердої поверхні, його супутники відкривають доступ до вражаючих порід. З Європи можна отримати прозорі льодові уламки, а з Іо — вулканічні камені з насиченим червоно-чорним забарвленням. Уламки з Ганімеда й Каллісто містять вуглецеві та льодові структури з характерним блиском, що відображає таємничість системи Юпітера.",
  },
  saturn: {
    semiMajorAxesKm: 1426666422,
    cameraPosition: { x: 0.001, y: 0.2, z: 1.3 },
    cameraLookAtPosition: { x: 0.11, y: 0, z: 0.02 },
    lerpSpeed: 0.03,
    planetNameUkr: "Сатурн",
    description:
      "Камені з супутників Сатурна, таких як Титан, мають текстуру застиглого бурштину. Уламки багаті на вуглецеві породи з теплими відтінками жовтого та червоного. Частинки кілець Сатурна, а також уламки Енцелада, який має крижані кристали, створюють унікальне поєднання для декоративних і космічних колекцій.",
  },
  uranus: {
    semiMajorAxesKm: 2870658186,
    cameraPosition: { x: 0.001, y: -0.3, z: 1.3 },
    cameraLookAtPosition: { x: 0.11, y: 0, z: 0.02 },
    lerpSpeed: 0.05,
    planetNameUkr: "Уран",
    description:
      "Породи з Урану — це переважно замерзлі уламки з кришталево-блакитним блиском. Вони мають витончену структуру, що нагадує космічний лід. Його супутники, такі як Міранда й Аріель, можуть постачати породи, що складаються зі змішаного льоду й каменю, які нагадують застиглі хвилі іншого світу.",
  },
  neptune: {
    semiMajorAxesKm: 4495100000,
    cameraPosition: { x: -0.1, y: -0.3, z: 1 },
    cameraLookAtPosition: { x: 0.09, y: 0, z: 0.02 },
    lerpSpeed: 0.05,
    planetNameUkr: "Нептун",
    description:
      "Камені Нептуна включають крижані породи, поєднані з темними, вулканічними уламками супутників. З Тритона можна отримати заморожені скельні утворення з рожевими й сірими прожилками, що створюють ілюзію кристалів. Їхній вигляд ідеально підходить для поціновувачів космічної естетики та історій із глибин Всесвіту.",
  },
};
